public class Main {
    public static void main(String[] args) {


        //Создать массив из 10 000 людей.
        //У каждого человека есть имя и возраст (случайное число в адекватных диапазонах).
        //Имена можно генерировать в формате: User1, User2, User3, User4
        //
        //Вывести возраст, который встречается чаще остальных.


      Human names = new Human();
      Human ages = new Human();

      System.out.println(ages);






        }

    }

