public class home2 {
    public static void main(String[] args) {

//        Задача 3 ().*
//        Смоделировать с помощью датчика случайных чисел Math.random() поведение
//        курса какой-либо валюты или биржевого индекса за март 2023 года.
//        Определить тренд по разнице средних значений за первую и последнюю декаду месяца.

        int[] days = new int[31];
        int BTC = 0;
        for (int i = 0; i < days.length; i++) {
            days[i] = (int) (Math.random() * 31);
            System.out.print(days[i] + " | ");}





        }
        }


